#include <stdio.h>
#include <stdlib.h>

/* 
ผู้ที่ได้คะแนนตั้งแต่ 90 คะแนนขึ้นไปจะได้เกรด A
ผู้ที่ได้คะแนนตั้งแต่ 85 - 89 จะได้เกรด B+
ผู้ที่ได้คะแนนตั้งแต่ 80 - 84 จะได้เกรด B
ผู้ที่ได้คะแนนตั้งแต่ 75 - 79 จะได้เกรด C+
ผู้ที่ได้คะแนนตั้งแต่ 70 - 74 จะได้เกรด C
ผู้ที่ได้คะแนนตั้งแต่ 65 - 69 จะได้เกรด D+
ผู้ที่ได้คะแนนตั้งแต่ 60 - 64 จะได้เกรด D
ผู้ที่ได้คะแนนต่ำกว่า 60 ลงไปจะได้เกรด F
*/

int main() {
    int sc;
    scanf("%d",&sc);
    if (sc >= 90 && sc <= 100) {
        printf("A");
    } else if (sc >= 85 && sc <= 89) {
        printf("B+");
    } else if (sc >= 80 && sc <= 84) {
        printf("B");
    } else if (sc >= 75 && sc <= 79) {
        printf("C+");
    } else if (sc >= 70 && sc <= 74) {
        printf("C");
    } else if (sc >= 65 && sc <= 69) {
        printf("D+");
    } else if (sc >= 60 && sc <= 64) {
        printf("D");
    } else {
        printf("F");
    }
    return 0;
}

